Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/NonSecure/firmware/src/packs/PIC32CK2051SG01144_DFP/component/fuses.h
/* -------- FUSES_FUCFG10 : (FUSES Offset: 0x68) (R/W 32) User Configuration 10 (Peripheral Bus A security attribution -------- */
#define FUSES_FUCFG10_NONSECA_PM_Pos          _UINT32_(3)                                          /* (FUSES_FUCFG10) BOOTROM NONSEC A Power Manager secure/non-secure Position */
#define FUSES_FUCFG10_NONSECA_PM_Msk          (_UINT32_(0x1) << FUSES_FUCFG10_NONSECA_PM_Pos)      /* (FUSES_FUCFG10) BOOTROM NONSEC A Power Manager secure/non-secure Mask */
#define FUSES_FUCFG10_NONSECA_PM(value)       (FUSES_FUCFG10_NONSECA_PM_Msk & (_UINT32_(value) << FUSES_FUCFG10_NONSECA_PM_Pos)) /* Assigment of value for NONSECA_PM in the FUSES_FUCFG10 register */
#define FUSES_FUCFG10_NONSECA_SUPC_Pos        _UINT32_(4)                                          /* (FUSES_FUCFG10) BOOTROM NONSEC A Supply Controller secure/non-secure Position */
#define FUSES_FUCFG10_NONSECA_SUPC_Msk        (_UINT32_(0x1) << FUSES_FUCFG10_NONSECA_SUPC_Pos)    /* (FUSES_FUCFG10) BOOTROM NONSEC A Supply Controller secure/non-secure Mask */
#define FUSES_FUCFG10_NONSECA_SUPC(value)     (FUSES_FUCFG10_NONSECA_SUPC_Msk & (_UINT32_(value) << FUSES_FUCFG10_NONSECA_SUPC_Pos)) /* Assigment of value for NONSECA_SUPC in the FUSES_FUCFG10 register */
#define FUSES_FUCFG10_NONSECA_RSTC_Pos        _UINT32_(5)                                          /* (FUSES_FUCFG10) BOOTROM NONSEC A Reset Controller secure/non-secure Position */
#define FUSES_FUCFG10_NONSECA_RSTC_Msk        (_UINT32_(0x1) << FUSES_FUCFG10_NONSECA_RSTC_Pos)    /* (FUSES_FUCFG10) BOOTROM NONSEC A Reset Controller secure/non-secure Mask */
#define FUSES_FUCFG10_NONSECA_RSTC(value)     (FUSES_FUCFG10_NONSECA_RSTC_Msk & (_UINT32_(value) << FUSES_FUCFG10_NONSECA_RSTC_Pos)) /* Assigment of value for NONSECA_RSTC in the FUSES_FUCFG10 register */
#define FUSES_FUCFG10_NONSECA_OSCCTRL_Pos     _UINT32_(6)                                          /* (FUSES_FUCFG10) BOOTROM NONSEC A Oscillator Control secure/non-secure Position */
#define FUSES_FUCFG10_NONSECA_OSCCTRL_Msk     (_UINT32_(0x1) << FUSES_FUCFG10_NONSECA_OSCCTRL_Pos) /* (FUSES_FUCFG10) BOOTROM NONSEC A Oscillator Control secure/non-secure Mask */
#define FUSES_FUCFG10_NONSECA_OSCCTRL(value)  (FUSES_FUCFG10_NONSECA_OSCCTRL_Msk & (_UINT32_(value) << FUSES_FUCFG10_NONSECA_OSCCTRL_Pos)) /* Assigment of value for NONSECA_OSCCTRL in the FUSES_FUCFG10 register */
#define FUSES_FUCFG10_NONSECA_OSC32KCTRL_Pos  _UINT32_(7)                                          /* (FUSES_FUCFG10) BOOTROM NONSEC A 32k Oscillator Control secure/non-secure Position */
#define FUSES_FUCFG10_NONSECA_OSC32KCTRL_Msk  (_UINT32_(0x1) << FUSES_FUCFG10_NONSECA_OSC32KCTRL_Pos) /* (FUSES_FUCFG10) BOOTROM NONSEC A 32k Oscillator Control secure/non-secure Mask */
#define FUSES_FUCFG10_NONSECA_OSC32KCTRL(value) (FUSES_FUCFG10_NONSECA_OSC32KCTRL_Msk & (_UINT32_(value) << FUSES_FUCFG10_NONSECA_OSC32KCTRL_Pos)) /* Assigment of value for NONSECA_OSC32KCTRL in the FUSES_FUCFG10 register */
#define FUSES_FUCFG10_NONSECA_GCLK_Pos        _UINT32_(8)                                          /* (FUSES_FUCFG10) BOOTROM NONSEC A Generic Clock secure/non-secure Position */
#define FUSES_FUCFG10_NONSECA_GCLK_Msk        (_UINT32_(0x1) << FUSES_FUCFG10_NONSECA_GCLK_Pos)    /* (FUSES_FUCFG10) BOOTROM NONSEC A Generic Clock secure/non-secure Mask */
#define FUSES_FUCFG10_NONSECA_GCLK(value)     (FUSES_FUCFG10_NONSECA_GCLK_Msk & (_UINT32_(value) << FUSES_FUCFG10_NONSECA_GCLK_Pos)) /* Assigment of value for NONSECA_GCLK in the FUSES_FUCFG10 register */
#define FUSES_FUCFG10_NONSECA_MCLK_Pos        _UINT32_(9)                                          /* (FUSES_FUCFG10) BOOTROM NONSEC A Main Clock secure/non-secure Position */
#define FUSES_FUCFG10_NONSECA_MCLK_Msk        (_UINT32_(0x1) << FUSES_FUCFG10_NONSECA_MCLK_Pos)    /* (FUSES_FUCFG10) BOOTROM NONSEC A Main Clock secure/non-secure Mask */
#define FUSES_FUCFG10_NONSECA_MCLK(value)     (FUSES_FUCFG10_NONSECA_MCLK_Msk & (_UINT32_(value) << FUSES_FUCFG10_NONSECA_MCLK_Pos)) /* Assigment of value for NONSECA_MCLK in the FUSES_FUCFG10 register */
#define FUSES_FUCFG10_NONSECA_FREQM_Pos       _UINT32_(10)                                         /* (FUSES_FUCFG10) BOOTROM NONSEC A Frequency Meter secure/non-secure Position */
#define FUSES_FUCFG10_NONSECA_FREQM_Msk       (_UINT32_(0x1) << FUSES_FUCFG10_NONSECA_FREQM_Pos)   /* (FUSES_FUCFG10) BOOTROM NONSEC A Frequency Meter secure/non-secure Mask */
#define FUSES_FUCFG10_NONSECA_FREQM(value)    (FUSES_FUCFG10_NONSECA_FREQM_Msk & (_UINT32_(value) << FUSES_FUCFG10_NONSECA_FREQM_Pos)) /* Assigment of value for NONSECA_FREQM in the FUSES_FUCFG10 register */
#define FUSES_FUCFG10_NONSECA_WDT_Pos         _UINT32_(11)                                         /* (FUSES_FUCFG10) BOOTROM NONSEC A Watchdog Timer secure/non-secure Position */
#define FUSES_FUCFG10_NONSECA_WDT_Msk         (_UINT32_(0x1) << FUSES_FUCFG10_NONSECA_WDT_Pos)     /* (FUSES_FUCFG10) BOOTROM NONSEC A Watchdog Timer secure/non-secure Mask */
#define FUSES_FUCFG10_NONSECA_WDT(value)      (FUSES_FUCFG10_NONSECA_WDT_Msk & (_UINT32_(value) << FUSES_FUCFG10_NONSECA_WDT_Pos)) /* Assigment of value for NONSECA_WDT in the FUSES_FUCFG10 register */
#define FUSES_FUCFG10_NONSECA_RTC_Pos         _UINT32_(12)                                         /* (FUSES_FUCFG10) BOOTROM NONSEC A Real Time Clock secure/non-secure Position */
#define FUSES_FUCFG10_NONSECA_RTC_Msk         (_UINT32_(0x1) << FUSES_FUCFG10_NONSECA_RTC_Pos)     /* (FUSES_FUCFG10) BOOTROM NONSEC A Real Time Clock secure/non-secure Mask */
#define FUSES_FUCFG10_NONSECA_RTC(value)      (FUSES_FUCFG10_NONSECA_RTC_Msk & (_UINT32_(value) << FUSES_FUCFG10_NONSECA_RTC_Pos)) /* Assigment of value for NONSECA_RTC in the FUSES_FUCFG10 register */
#define FUSES_FUCFG10_NONSECA_EIC_Pos         _UINT32_(13)                                         /* (FUSES_FUCFG10) BOOTROM NONSEC A External Interrupt Controller secure/non-secure Position */
#define FUSES_FUCFG10_NONSECA_EIC_Msk         (_UINT32_(0x1) << FUSES_FUCFG10_NONSECA_EIC_Pos)     /* (FUSES_FUCFG10) BOOTROM NONSEC A External Interrupt Controller secure/non-secure Mask */
#define FUSES_FUCFG10_NONSECA_EIC(value)      (FUSES_FUCFG10_NONSECA_EIC_Msk & (_UINT32_(value) << FUSES_FUCFG10_NONSECA_EIC_Pos)) /* Assigment of value for NONSECA_EIC in the FUSES_FUCFG10 register */
#define FUSES_FUCFG10_NONSECA_PAC_Pos         _UINT32_(14)                                         /* (FUSES_FUCFG10) BOOTROM NONSEC A Peripheral Access Controller secure/non-secure Position */
#define FUSES_FUCFG10_NONSECA_PAC_Msk         (_UINT32_(0x1) << FUSES_FUCFG10_NONSECA_PAC_Pos)     /* (FUSES_FUCFG10) BOOTROM NONSEC A Peripheral Access Controller secure/non-secure Mask */
#define FUSES_FUCFG10_NONSECA_PAC(value)      (FUSES_FUCFG10_NONSECA_PAC_Msk & (_UINT32_(value) << FUSES_FUCFG10_NONSECA_PAC_Pos)) /* Assigment of value for NONSECA_PAC in the FUSES_FUCFG10 register */
#define FUSES_FUCFG10_Msk                     _UINT32_(0x00007FF8)                                 /* (FUSES_FUCFG10) Register Mask  */


/* -------- FUSES_FUCFG11 : (FUSES Offset: 0x6C) (R/W 32) User Configuration 11 (Peripheral Bus B security attribution -------- */
#define FUSES_FUCFG11_NONSECB_PORT_Pos        _UINT32_(0)                                          /* (FUSES_FUCFG11) BOOTROM NONSEC B PORT secure/non-secure Position */
#define FUSES_FUCFG11_NONSECB_PORT_Msk        (_UINT32_(0x1) << FUSES_FUCFG11_NONSECB_PORT_Pos)    /* (FUSES_FUCFG11) BOOTROM NONSEC B PORT secure/non-secure Mask */
#define FUSES_FUCFG11_NONSECB_PORT(value)     (FUSES_FUCFG11_NONSECB_PORT_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_PORT_Pos)) /* Assigment of value for NONSECB_PORT in the FUSES_FUCFG11 register */
#define FUSES_FUCFG11_NONSECB_DMA0_Pos        _UINT32_(1)                                          /* (FUSES_FUCFG11) BOOTROM NONSEC B DMA0 secure/non-secure Position */
#define FUSES_FUCFG11_NONSECB_DMA0_Msk        (_UINT32_(0x1) << FUSES_FUCFG11_NONSECB_DMA0_Pos)    /* (FUSES_FUCFG11) BOOTROM NONSEC B DMA0 secure/non-secure Mask */
#define FUSES_FUCFG11_NONSECB_DMA0(value)     (FUSES_FUCFG11_NONSECB_DMA0_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_DMA0_Pos)) /* Assigment of value for NONSECB_DMA0 in the FUSES_FUCFG11 register */
#define FUSES_FUCFG11_NONSECB_DMA1_Pos        _UINT32_(2)                                          /* (FUSES_FUCFG11) BOOTROM NONSEC B DMA1 secure/non-secure Position */
#define FUSES_FUCFG11_NONSECB_DMA1_Msk        (_UINT32_(0x1) << FUSES_FUCFG11_NONSECB_DMA1_Pos)    /* (FUSES_FUCFG11) BOOTROM NONSEC B DMA1 secure/non-secure Mask */
#define FUSES_FUCFG11_NONSECB_DMA1(value)     (FUSES_FUCFG11_NONSECB_DMA1_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_DMA1_Pos)) /* Assigment of value for NONSECB_DMA1 in the FUSES_FUCFG11 register */
#define FUSES_FUCFG11_NONSECB_HMATRIX_Pos     _UINT32_(3)                                          /* (FUSES_FUCFG11) BOOTROM NONSEC B HMATRIX secure/non-secure Position */
#define FUSES_FUCFG11_NONSECB_HMATRIX_Msk     (_UINT32_(0x1) << FUSES_FUCFG11_NONSECB_HMATRIX_Pos) /* (FUSES_FUCFG11) BOOTROM NONSEC B HMATRIX secure/non-secure Mask */
#define FUSES_FUCFG11_NONSECB_HMATRIX(value)  (FUSES_FUCFG11_NONSECB_HMATRIX_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_HMATRIX_Pos)) /* Assigment of value for NONSECB_HMATRIX in the FUSES_FUCFG11 register */
#define FUSES_FUCFG11_NONSECB_CMCC_Pos        _UINT32_(4)                                          /* (FUSES_FUCFG11) BOOTROM NONSEC B Cortex M Cache Controller secure/non-secure Position */
#define FUSES_FUCFG11_NONSECB_CMCC_Msk        (_UINT32_(0x1) << FUSES_FUCFG11_NONSECB_CMCC_Pos)    /* (FUSES_FUCFG11) BOOTROM NONSEC B Cortex M Cache Controller secure/non-secure Mask */
#define FUSES_FUCFG11_NONSECB_CMCC(value)     (FUSES_FUCFG11_NONSECB_CMCC_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_CMCC_Pos)) /* Assigment of value for NONSECB_CMCC in the FUSES_FUCFG11 register */
#define FUSES_FUCFG11_NONSECB_PRM_Pos         _UINT32_(5)                                          /* (FUSES_FUCFG11) BOOTROM NONSEC B Boot ROM secure/non-secure Position */
#define FUSES_FUCFG11_NONSECB_PRM_Msk         (_UINT32_(0x1) << FUSES_FUCFG11_NONSECB_PRM_Pos)     /* (FUSES_FUCFG11) BOOTROM NONSEC B Boot ROM secure/non-secure Mask */
#define FUSES_FUCFG11_NONSECB_PRM(value)      (FUSES_FUCFG11_NONSECB_PRM_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_PRM_Pos)) /* Assigment of value for NONSECB_PRM in the FUSES_FUCFG11 register */
#define FUSES_FUCFG11_NONSECB_EVSYS_Pos       _UINT32_(7)                                          /* (FUSES_FUCFG11) BOOTROM NONSEC B Event System secure/non-secure Position */
#define FUSES_FUCFG11_NONSECB_EVSYS_Msk       (_UINT32_(0x1) << FUSES_FUCFG11_NONSECB_EVSYS_Pos)   /* (FUSES_FUCFG11) BOOTROM NONSEC B Event System secure/non-secure Mask */
#define FUSES_FUCFG11_NONSECB_EVSYS(value)    (FUSES_FUCFG11_NONSECB_EVSYS_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_EVSYS_Pos)) /* Assigment of value for NONSECB_EVSYS in the FUSES_FUCFG11 register */
#define FUSES_FUCFG11_NONSECB_SERCOM0_Pos     _UINT32_(8)                                          /* (FUSES_FUCFG11) BOOTROM NONSEC B SERCOM0 secure/non-secure Position */
#define FUSES_FUCFG11_NONSECB_SERCOM0_Msk     (_UINT32_(0x1) << FUSES_FUCFG11_NONSECB_SERCOM0_Pos) /* (FUSES_FUCFG11) BOOTROM NONSEC B SERCOM0 secure/non-secure Mask */
#define FUSES_FUCFG11_NONSECB_SERCOM0(value)  (FUSES_FUCFG11_NONSECB_SERCOM0_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_SERCOM0_Pos)) /* Assigment of value for NONSECB_SERCOM0 in the FUSES_FUCFG11 register */
#define FUSES_FUCFG11_NONSECB_SERCOM1_Pos     _UINT32_(9)                                          /* (FUSES_FUCFG11) BOOTROM NONSEC B SERCOM1 secure/non-secure Position */
#define FUSES_FUCFG11_NONSECB_SERCOM1_Msk     (_UINT32_(0x1) << FUSES_FUCFG11_NONSECB_SERCOM1_Pos) /* (FUSES_FUCFG11) BOOTROM NONSEC B SERCOM1 secure/non-secure Mask */
#define FUSES_FUCFG11_NONSECB_SERCOM1(value)  (FUSES_FUCFG11_NONSECB_SERCOM1_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_SERCOM1_Pos)) /* Assigment of value for NONSECB_SERCOM1 in the FUSES_FUCFG11 register */
#define FUSES_FUCFG11_NONSECB_SERCOM2_Pos     _UINT32_(10)                                         /* (FUSES_FUCFG11) BOOTROM NONSEC B SERCOM2 secure/non-secure Position */
#define FUSES_FUCFG11_NONSECB_SERCOM2_Msk     (_UINT32_(0x1) << FUSES_FUCFG11_NONSECB_SERCOM2_Pos) /* (FUSES_FUCFG11) BOOTROM NONSEC B SERCOM2 secure/non-secure Mask */
#define FUSES_FUCFG11_NONSECB_SERCOM2(value)  (FUSES_FUCFG11_NONSECB_SERCOM2_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_SERCOM2_Pos)) /* Assigment of value for NONSECB_SERCOM2 in the FUSES_FUCFG11 register */
#define FUSES_FUCFG11_NONSECB_SERCOM3_Pos     _UINT32_(11)                                         /* (FUSES_FUCFG11) BOOTROM NONSEC B SERCOM3 secure/non-secure Position */
#define FUSES_FUCFG11_NONSECB_SERCOM3_Msk     (_UINT32_(0x1) << FUSES_FUCFG11_NONSECB_SERCOM3_Pos) /* (FUSES_FUCFG11) BOOTROM NONSEC B SERCOM3 secure/non-secure Mask */
#define FUSES_FUCFG11_NONSECB_SERCOM3(value)  (FUSES_FUCFG11_NONSECB_SERCOM3_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_SERCOM3_Pos)) /* Assigment of value for NONSECB_SERCOM3 in the FUSES_FUCFG11 register */
#define FUSES_FUCFG11_NONSECB_TCC0_Pos        _UINT32_(12)                                         /* (FUSES_FUCFG11) BOOTROM NONSEC B TCC0 secure/non-secure Position */
#define FUSES_FUCFG11_NONSECB_TCC0_Msk        (_UINT32_(0x1) << FUSES_FUCFG11_NONSECB_TCC0_Pos)    /* (FUSES_FUCFG11) BOOTROM NONSEC B TCC0 secure/non-secure Mask */
#define FUSES_FUCFG11_NONSECB_TCC0(value)     (FUSES_FUCFG11_NONSECB_TCC0_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_TCC0_Pos)) /* Assigment of value for NONSECB_TCC0 in the FUSES_FUCFG11 register */
#define FUSES_FUCFG11_NONSECB_TCC1_Pos        _UINT32_(13)                                         /* (FUSES_FUCFG11) BOOTROM NONSEC B TCC1 secure/non-secure Position */
#define FUSES_FUCFG11_NONSECB_TCC1_Msk        (_UINT32_(0x1) << FUSES_FUCFG11_NONSECB_TCC1_Pos)    /* (FUSES_FUCFG11) BOOTROM NONSEC B TCC1 secure/non-secure Mask */
#define FUSES_FUCFG11_NONSECB_TCC1(value)     (FUSES_FUCFG11_NONSECB_TCC1_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_TCC1_Pos)) /* Assigment of value for NONSECB_TCC1 in the FUSES_FUCFG11 register */
#define FUSES_FUCFG11_NONSECB_TCC2_Pos        _UINT32_(14)                                         /* (FUSES_FUCFG11) BOOTROM NONSEC B TCC2 secure/non-secure Position */
#define FUSES_FUCFG11_NONSECB_TCC2_Msk        (_UINT32_(0x1) << FUSES_FUCFG11_NONSECB_TCC2_Pos)    /* (FUSES_FUCFG11) BOOTROM NONSEC B TCC2 secure/non-secure Mask */
#define FUSES_FUCFG11_NONSECB_TCC2(value)     (FUSES_FUCFG11_NONSECB_TCC2_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_TCC2_Pos)) /* Assigment of value for NONSECB_TCC2 in the FUSES_FUCFG11 register */
#define FUSES_FUCFG11_NONSECB_TCC3_Pos        _UINT32_(15)                                         /* (FUSES_FUCFG11) BOOTROM NONSEC B TCC3 secure/non-secure Position */
#define FUSES_FUCFG11_NONSECB_TCC3_Msk        (_UINT32_(0x1) << FUSES_FUCFG11_NONSECB_TCC3_Pos)    /* (FUSES_FUCFG11) BOOTROM NONSEC B TCC3 secure/non-secure Mask */
#define FUSES_FUCFG11_NONSECB_TCC3(value)     (FUSES_FUCFG11_NONSECB_TCC3_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_TCC3_Pos)) /* Assigment of value for NONSECB_TCC3 in the FUSES_FUCFG11 register */
#define FUSES_FUCFG11_Msk                     _UINT32_(0x0000FFBF)                                 /* (FUSES_FUCFG11) Register Mask  */

#define FUSES_FUCFG11_NONSECB_DMA_Pos         _UINT32_(1)                                          /* (FUSES_FUCFG11 Position) BOOTROM NONSEC B DMAx secure/non-secure */
#define FUSES_FUCFG11_NONSECB_DMA_Msk         (_UINT32_(0x3) << FUSES_FUCFG11_NONSECB_DMA_Pos)     /* (FUSES_FUCFG11 Mask) NONSECB_DMA */
#define FUSES_FUCFG11_NONSECB_DMA(value)      (FUSES_FUCFG11_NONSECB_DMA_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_DMA_Pos)) 
#define FUSES_FUCFG11_NONSECB_SERCOM_Pos      _UINT32_(8)                                          /* (FUSES_FUCFG11 Position) BOOTROM NONSEC B SERCOMx secure/non-secure */
#define FUSES_FUCFG11_NONSECB_SERCOM_Msk      (_UINT32_(0xF) << FUSES_FUCFG11_NONSECB_SERCOM_Pos)  /* (FUSES_FUCFG11 Mask) NONSECB_SERCOM */
#define FUSES_FUCFG11_NONSECB_SERCOM(value)   (FUSES_FUCFG11_NONSECB_SERCOM_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_SERCOM_Pos)) 
#define FUSES_FUCFG11_NONSECB_TCC_Pos         _UINT32_(12)                                         /* (FUSES_FUCFG11 Position) BOOTROM NONSEC B TCC3 secure/non-secure */
#define FUSES_FUCFG11_NONSECB_TCC_Msk         (_UINT32_(0xF) << FUSES_FUCFG11_NONSECB_TCC_Pos)     /* (FUSES_FUCFG11 Mask) NONSECB_TCC */
#define FUSES_FUCFG11_NONSECB_TCC(value)      (FUSES_FUCFG11_NONSECB_TCC_Msk & (_UINT32_(value) << FUSES_FUCFG11_NONSECB_TCC_Pos)) 

