Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/NonSecure/firmware/src/packs/PIC32CK2051SG01144_DFP/component/fuses.h
/* -------- FUSES_FUCFG12 : (FUSES Offset: 0x70) (R/W 32) User Configuration 12 (Peripheral Bus C security attribution -------- */
#define FUSES_FUCFG12_NONSECC_SERCOM4_Pos     _UINT32_(0)                                          /* (FUSES_FUCFG12) BOOTROM NONSEC C SERCOM4 secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_SERCOM4_Msk     (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_SERCOM4_Pos) /* (FUSES_FUCFG12) BOOTROM NONSEC C SERCOM4 secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_SERCOM4(value)  (FUSES_FUCFG12_NONSECC_SERCOM4_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_SERCOM4_Pos)) /* Assigment of value for NONSECC_SERCOM4 in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_SERCOM5_Pos     _UINT32_(1)                                          /* (FUSES_FUCFG12) BOOTROM NONSEC C SERCOM5 secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_SERCOM5_Msk     (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_SERCOM5_Pos) /* (FUSES_FUCFG12) BOOTROM NONSEC C SERCOM5 secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_SERCOM5(value)  (FUSES_FUCFG12_NONSECC_SERCOM5_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_SERCOM5_Pos)) /* Assigment of value for NONSECC_SERCOM5 in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_SERCOM6_Pos     _UINT32_(2)                                          /* (FUSES_FUCFG12) BOOTROM NONSEC C SERCOM6 secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_SERCOM6_Msk     (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_SERCOM6_Pos) /* (FUSES_FUCFG12) BOOTROM NONSEC C SERCOM6 secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_SERCOM6(value)  (FUSES_FUCFG12_NONSECC_SERCOM6_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_SERCOM6_Pos)) /* Assigment of value for NONSECC_SERCOM6 in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_SERCOM7_Pos     _UINT32_(3)                                          /* (FUSES_FUCFG12) BOOTROM NONSEC C SERCOM7 secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_SERCOM7_Msk     (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_SERCOM7_Pos) /* (FUSES_FUCFG12) BOOTROM NONSEC C SERCOM7 secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_SERCOM7(value)  (FUSES_FUCFG12_NONSECC_SERCOM7_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_SERCOM7_Pos)) /* Assigment of value for NONSECC_SERCOM7 in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_TCC4_Pos        _UINT32_(4)                                          /* (FUSES_FUCFG12) BOOTROM NONSEC C TCC4 secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_TCC4_Msk        (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_TCC4_Pos)    /* (FUSES_FUCFG12) BOOTROM NONSEC C TCC4 secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_TCC4(value)     (FUSES_FUCFG12_NONSECC_TCC4_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_TCC4_Pos)) /* Assigment of value for NONSECC_TCC4 in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_TCC5_Pos        _UINT32_(5)                                          /* (FUSES_FUCFG12) BOOTROM NONSEC C TCC5 secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_TCC5_Msk        (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_TCC5_Pos)    /* (FUSES_FUCFG12) BOOTROM NONSEC C TCC5 secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_TCC5(value)     (FUSES_FUCFG12_NONSECC_TCC5_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_TCC5_Pos)) /* Assigment of value for NONSECC_TCC5 in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_TCC6_Pos        _UINT32_(6)                                          /* (FUSES_FUCFG12) BOOTROM NONSEC C TCC6 secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_TCC6_Msk        (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_TCC6_Pos)    /* (FUSES_FUCFG12) BOOTROM NONSEC C TCC6 secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_TCC6(value)     (FUSES_FUCFG12_NONSECC_TCC6_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_TCC6_Pos)) /* Assigment of value for NONSECC_TCC6 in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_TCC7_Pos        _UINT32_(7)                                          /* (FUSES_FUCFG12) BOOTROM NONSEC C TCC7 secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_TCC7_Msk        (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_TCC7_Pos)    /* (FUSES_FUCFG12) BOOTROM NONSEC C TCC7 secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_TCC7(value)     (FUSES_FUCFG12_NONSECC_TCC7_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_TCC7_Pos)) /* Assigment of value for NONSECC_TCC7 in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_ADC_Pos         _UINT32_(8)                                          /* (FUSES_FUCFG12) BOOTROM NONSEC C ADC secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_ADC_Msk         (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_ADC_Pos)     /* (FUSES_FUCFG12) BOOTROM NONSEC C ADC secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_ADC(value)      (FUSES_FUCFG12_NONSECC_ADC_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_ADC_Pos)) /* Assigment of value for NONSECC_ADC in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_AC_Pos          _UINT32_(9)                                          /* (FUSES_FUCFG12) BOOTROM NONSEC C Analog Comparator secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_AC_Msk          (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_AC_Pos)      /* (FUSES_FUCFG12) BOOTROM NONSEC C Analog Comparator secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_AC(value)       (FUSES_FUCFG12_NONSECC_AC_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_AC_Pos)) /* Assigment of value for NONSECC_AC in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_PTC_Pos         _UINT32_(10)                                         /* (FUSES_FUCFG12) BOOTROM NONSEC C PTC secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_PTC_Msk         (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_PTC_Pos)     /* (FUSES_FUCFG12) BOOTROM NONSEC C PTC secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_PTC(value)      (FUSES_FUCFG12_NONSECC_PTC_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_PTC_Pos)) /* Assigment of value for NONSECC_PTC in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_SPI_IXS_Pos     _UINT32_(11)                                         /* (FUSES_FUCFG12) BOOTROM NONSEC C SPI_IXS secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_SPI_IXS_Msk     (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_SPI_IXS_Pos) /* (FUSES_FUCFG12) BOOTROM NONSEC C SPI_IXS secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_SPI_IXS(value)  (FUSES_FUCFG12_NONSECC_SPI_IXS_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_SPI_IXS_Pos)) /* Assigment of value for NONSECC_SPI_IXS in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_PCC_Pos         _UINT32_(12)                                         /* (FUSES_FUCFG12) BOOTROM NONSEC C PCC secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_PCC_Msk         (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_PCC_Pos)     /* (FUSES_FUCFG12) BOOTROM NONSEC C PCC secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_PCC(value)      (FUSES_FUCFG12_NONSECC_PCC_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_PCC_Pos)) /* Assigment of value for NONSECC_PCC in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_CCL_Pos         _UINT32_(13)                                         /* (FUSES_FUCFG12) BOOTROM NONSEC C CCL secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_CCL_Msk         (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_CCL_Pos)     /* (FUSES_FUCFG12) BOOTROM NONSEC C CCL secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_CCL(value)      (FUSES_FUCFG12_NONSECC_CCL_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_CCL_Pos)) /* Assigment of value for NONSECC_CCL in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_PDEC_Pos        _UINT32_(14)                                         /* (FUSES_FUCFG12) BOOTROM NONSEC C PDEC secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_PDEC_Msk        (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_PDEC_Pos)    /* (FUSES_FUCFG12) BOOTROM NONSEC C PDEC secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_PDEC(value)     (FUSES_FUCFG12_NONSECC_PDEC_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_PDEC_Pos)) /* Assigment of value for NONSECC_PDEC in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_CAN0_Pos        _UINT32_(15)                                         /* (FUSES_FUCFG12) BOOTROM NONSEC C CAN0 secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_CAN0_Msk        (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_CAN0_Pos)    /* (FUSES_FUCFG12) BOOTROM NONSEC C CAN0 secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_CAN0(value)     (FUSES_FUCFG12_NONSECC_CAN0_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_CAN0_Pos)) /* Assigment of value for NONSECC_CAN0 in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_CAN1_Pos        _UINT32_(16)                                         /* (FUSES_FUCFG12) BOOTROM NONSEC C CAN1 secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_CAN1_Msk        (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_CAN1_Pos)    /* (FUSES_FUCFG12) BOOTROM NONSEC C CAN1 secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_CAN1(value)     (FUSES_FUCFG12_NONSECC_CAN1_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_CAN1_Pos)) /* Assigment of value for NONSECC_CAN1 in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_ETH_Pos         _UINT32_(17)                                         /* (FUSES_FUCFG12) BOOTROM NONSEC C ETH secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_ETH_Msk         (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_ETH_Pos)     /* (FUSES_FUCFG12) BOOTROM NONSEC C ETH secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_ETH(value)      (FUSES_FUCFG12_NONSECC_ETH_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_ETH_Pos)) /* Assigment of value for NONSECC_ETH in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_TRNG_Pos        _UINT32_(18)                                         /* (FUSES_FUCFG12) BOOTROM NONSEC C TRNG secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_TRNG_Msk        (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_TRNG_Pos)    /* (FUSES_FUCFG12) BOOTROM NONSEC C TRNG secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_TRNG(value)     (FUSES_FUCFG12_NONSECC_TRNG_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_TRNG_Pos)) /* Assigment of value for NONSECC_TRNG in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_SDMMC0_Pos      _UINT32_(19)                                         /* (FUSES_FUCFG12) BOOTROM NONSEC C SDMMC0 secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_SDMMC0_Msk      (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_SDMMC0_Pos)  /* (FUSES_FUCFG12) BOOTROM NONSEC C SDMMC0 secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_SDMMC0(value)   (FUSES_FUCFG12_NONSECC_SDMMC0_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_SDMMC0_Pos)) /* Assigment of value for NONSECC_SDMMC0 in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_SDMMC1_Pos      _UINT32_(20)                                         /* (FUSES_FUCFG12) BOOTROM NONSEC C SDMMC1 secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_SDMMC1_Msk      (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_SDMMC1_Pos)  /* (FUSES_FUCFG12) BOOTROM NONSEC C SDMMC1 secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_SDMMC1(value)   (FUSES_FUCFG12_NONSECC_SDMMC1_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_SDMMC1_Pos)) /* Assigment of value for NONSECC_SDMMC1 in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_NONSECC_USB_Pos         _UINT32_(21)                                         /* (FUSES_FUCFG12) BOOTROM NONSEC C Full Speed USB secure/non-secure Position */
#define FUSES_FUCFG12_NONSECC_USB_Msk         (_UINT32_(0x1) << FUSES_FUCFG12_NONSECC_USB_Pos)     /* (FUSES_FUCFG12) BOOTROM NONSEC C Full Speed USB secure/non-secure Mask */
#define FUSES_FUCFG12_NONSECC_USB(value)      (FUSES_FUCFG12_NONSECC_USB_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_USB_Pos)) /* Assigment of value for NONSECC_USB in the FUSES_FUCFG12 register */
#define FUSES_FUCFG12_Msk                     _UINT32_(0x003FFFFF)                                 /* (FUSES_FUCFG12) Register Mask  */

#define FUSES_FUCFG12_NONSECC_SERCOM_Pos      _UINT32_(0)                                          /* (FUSES_FUCFG12 Position) BOOTROM NONSEC C SERCOM4 secure/non-secure */
#define FUSES_FUCFG12_NONSECC_SERCOM_Msk      (_UINT32_(0xF) << FUSES_FUCFG12_NONSECC_SERCOM_Pos)  /* (FUSES_FUCFG12 Mask) NONSECC_SERCOM */
#define FUSES_FUCFG12_NONSECC_SERCOM(value)   (FUSES_FUCFG12_NONSECC_SERCOM_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_SERCOM_Pos)) 
#define FUSES_FUCFG12_NONSECC_TCC_Pos         _UINT32_(4)                                          /* (FUSES_FUCFG12 Position) BOOTROM NONSEC C TCC4 secure/non-secure */
#define FUSES_FUCFG12_NONSECC_TCC_Msk         (_UINT32_(0xF) << FUSES_FUCFG12_NONSECC_TCC_Pos)     /* (FUSES_FUCFG12 Mask) NONSECC_TCC */
#define FUSES_FUCFG12_NONSECC_TCC(value)      (FUSES_FUCFG12_NONSECC_TCC_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_TCC_Pos)) 
#define FUSES_FUCFG12_NONSECC_CAN_Pos         _UINT32_(15)                                         /* (FUSES_FUCFG12 Position) BOOTROM NONSEC C CANx secure/non-secure */
#define FUSES_FUCFG12_NONSECC_CAN_Msk         (_UINT32_(0x3) << FUSES_FUCFG12_NONSECC_CAN_Pos)     /* (FUSES_FUCFG12 Mask) NONSECC_CAN */
#define FUSES_FUCFG12_NONSECC_CAN(value)      (FUSES_FUCFG12_NONSECC_CAN_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_CAN_Pos)) 
#define FUSES_FUCFG12_NONSECC_SDMMC_Pos       _UINT32_(19)                                         /* (FUSES_FUCFG12 Position) BOOTROM NONSEC C SDMMCx secure/non-secure */
#define FUSES_FUCFG12_NONSECC_SDMMC_Msk       (_UINT32_(0x3) << FUSES_FUCFG12_NONSECC_SDMMC_Pos)   /* (FUSES_FUCFG12 Mask) NONSECC_SDMMC */
#define FUSES_FUCFG12_NONSECC_SDMMC(value)    (FUSES_FUCFG12_NONSECC_SDMMC_Msk & (_UINT32_(value) << FUSES_FUCFG12_NONSECC_SDMMC_Pos)) 

