Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/NonSecure/firmware/src/packs/PIC32CK2051SG01144_DFP/component/fuses.h
/* -------- FUSES_FUCFG13 : (FUSES Offset: 0x74) (R/W 32) User Configuration 13 (AHB peripheral security attribution -------- */
#define FUSES_FUCFG13_NONSEC_AHB_SQI_Pos      _UINT32_(0)                                          /* (FUSES_FUCFG13) BOOTROM NONSEC AHB SQI secure/non-secure Position */
#define FUSES_FUCFG13_NONSEC_AHB_SQI_Msk      (_UINT32_(0x1) << FUSES_FUCFG13_NONSEC_AHB_SQI_Pos)  /* (FUSES_FUCFG13) BOOTROM NONSEC AHB SQI secure/non-secure Mask */
#define FUSES_FUCFG13_NONSEC_AHB_SQI(value)   (FUSES_FUCFG13_NONSEC_AHB_SQI_Msk & (_UINT32_(value) << FUSES_FUCFG13_NONSEC_AHB_SQI_Pos)) /* Assigment of value for NONSEC_AHB_SQI in the FUSES_FUCFG13 register */
#define FUSES_FUCFG13_NONSEC_AHB_USBHS_Pos    _UINT32_(1)                                          /* (FUSES_FUCFG13) BOOTROM NONSEC AHB USB High Speed secure/non-secure Position */
#define FUSES_FUCFG13_NONSEC_AHB_USBHS_Msk    (_UINT32_(0x1) << FUSES_FUCFG13_NONSEC_AHB_USBHS_Pos) /* (FUSES_FUCFG13) BOOTROM NONSEC AHB USB High Speed secure/non-secure Mask */
#define FUSES_FUCFG13_NONSEC_AHB_USBHS(value) (FUSES_FUCFG13_NONSEC_AHB_USBHS_Msk & (_UINT32_(value) << FUSES_FUCFG13_NONSEC_AHB_USBHS_Pos)) /* Assigment of value for NONSEC_AHB_USBHS in the FUSES_FUCFG13 register */
#define FUSES_FUCFG13_NONSEC_AHB_HSM_Pos      _UINT32_(2)                                          /* (FUSES_FUCFG13) BOOTROM NONSEC AHB HSM secure/non-secure Position */
#define FUSES_FUCFG13_NONSEC_AHB_HSM_Msk      (_UINT32_(0x1) << FUSES_FUCFG13_NONSEC_AHB_HSM_Pos)  /* (FUSES_FUCFG13) BOOTROM NONSEC AHB HSM secure/non-secure Mask */
#define FUSES_FUCFG13_NONSEC_AHB_HSM(value)   (FUSES_FUCFG13_NONSEC_AHB_HSM_Msk & (_UINT32_(value) << FUSES_FUCFG13_NONSEC_AHB_HSM_Pos)) /* Assigment of value for NONSEC_AHB_HSM in the FUSES_FUCFG13 register */
#define FUSES_FUCFG13_Msk                     _UINT32_(0x00000007)                                 /* (FUSES_FUCFG13) Register Mask  */


/* -------- FUSES_FUCFG14 : (FUSES Offset: 0x78) (R/W 32) PFM IDAU Configuration -------- */
#define FUSES_FUCFG14_IDAU_ANS_Pos            _UINT32_(0)                                          /* (FUSES_FUCFG14) Non-secure Flash application size Position */
#define FUSES_FUCFG14_IDAU_ANS_Msk            (_UINT32_(0x1FF) << FUSES_FUCFG14_IDAU_ANS_Pos)      /* (FUSES_FUCFG14) Non-secure Flash application size Mask */
#define FUSES_FUCFG14_IDAU_ANS(value)         (FUSES_FUCFG14_IDAU_ANS_Msk & (_UINT32_(value) << FUSES_FUCFG14_IDAU_ANS_Pos)) /* Assigment of value for IDAU_ANS in the FUSES_FUCFG14 register */
#define FUSES_FUCFG14_IDAU_ANSC_Pos           _UINT32_(16)                                         /* (FUSES_FUCFG14) Non-secure callable Flash application size Position */
#define FUSES_FUCFG14_IDAU_ANSC_Msk           (_UINT32_(0x1) << FUSES_FUCFG14_IDAU_ANSC_Pos)       /* (FUSES_FUCFG14) Non-secure callable Flash application size Mask */
#define FUSES_FUCFG14_IDAU_ANSC(value)        (FUSES_FUCFG14_IDAU_ANSC_Msk & (_UINT32_(value) << FUSES_FUCFG14_IDAU_ANSC_Pos)) /* Assigment of value for IDAU_ANSC in the FUSES_FUCFG14 register */
#define FUSES_FUCFG14_Msk                     _UINT32_(0x000101FF)                                 /* (FUSES_FUCFG14) Register Mask  */


/* -------- FUSES_FUCFG15 : (FUSES Offset: 0x7C) (R/W 32) RAM IDAU Configuration -------- */
#define FUSES_FUCFG15_IDAU_RNS_Pos            _UINT32_(0)                                          /* (FUSES_FUCFG15) Non-secure RAM size Position */
#define FUSES_FUCFG15_IDAU_RNS_Msk            (_UINT32_(0x7F) << FUSES_FUCFG15_IDAU_RNS_Pos)       /* (FUSES_FUCFG15) Non-secure RAM size Mask */
#define FUSES_FUCFG15_IDAU_RNS(value)         (FUSES_FUCFG15_IDAU_RNS_Msk & (_UINT32_(value) << FUSES_FUCFG15_IDAU_RNS_Pos)) /* Assigment of value for IDAU_RNS in the FUSES_FUCFG15 register */
#define FUSES_FUCFG15_Msk                     _UINT32_(0x0000007F)                                 /* (FUSES_FUCFG15) Register Mask  */


/* -------- FUSES_FUCFG16 : (FUSES Offset: 0x80) (R/W 32) User Configuration 16 (HSM Firmware Metadata 0 Address) -------- */
#define FUSES_FUCFG16_HSM_PTRMETA0_Pos        _UINT32_(0)                                          /* (FUSES_FUCFG16) HSM Firmware Metadata pointer 0 Position */
#define FUSES_FUCFG16_HSM_PTRMETA0_Msk        (_UINT32_(0xFFFFFFFF) << FUSES_FUCFG16_HSM_PTRMETA0_Pos) /* (FUSES_FUCFG16) HSM Firmware Metadata pointer 0 Mask */
#define FUSES_FUCFG16_HSM_PTRMETA0(value)     (FUSES_FUCFG16_HSM_PTRMETA0_Msk & (_UINT32_(value) << FUSES_FUCFG16_HSM_PTRMETA0_Pos)) /* Assigment of value for HSM_PTRMETA0 in the FUSES_FUCFG16 register */
#define FUSES_FUCFG16_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FUCFG16) Register Mask  */


/* -------- FUSES_FUCFG24 : (FUSES Offset: 0xA0) (R/W 32) User Configuration 24 (HSM Firmware Metadata 1 Address) -------- */
#define FUSES_FUCFG24_HSM_PTRMETA1_Pos        _UINT32_(0)                                          /* (FUSES_FUCFG24) HSM Firmware Metadata pointer 1 Position */
#define FUSES_FUCFG24_HSM_PTRMETA1_Msk        (_UINT32_(0xFFFFFFFF) << FUSES_FUCFG24_HSM_PTRMETA1_Pos) /* (FUSES_FUCFG24) HSM Firmware Metadata pointer 1 Mask */
#define FUSES_FUCFG24_HSM_PTRMETA1(value)     (FUSES_FUCFG24_HSM_PTRMETA1_Msk & (_UINT32_(value) << FUSES_FUCFG24_HSM_PTRMETA1_Pos)) /* Assigment of value for HSM_PTRMETA1 in the FUSES_FUCFG24 register */
#define FUSES_FUCFG24_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FUCFG24) Register Mask  */


/* -------- FUSES_FCCFG64 : (FUSES Offset: 0x180) ( R/ 32) PTC Calibration -------- */
#define FUSES_FCCFG64_PTCFG0_Pos              _UINT32_(0)                                          /* (FUSES_FCCFG64)  Position */
#define FUSES_FCCFG64_PTCFG0_Msk              (_UINT32_(0xFFFF) << FUSES_FCCFG64_PTCFG0_Pos)       /* (FUSES_FCCFG64)  Mask */
#define FUSES_FCCFG64_PTCFG0(value)           (FUSES_FCCFG64_PTCFG0_Msk & (_UINT32_(value) << FUSES_FCCFG64_PTCFG0_Pos)) /* Assigment of value for PTCFG0 in the FUSES_FCCFG64 register */
#define FUSES_FCCFG64_Msk                     _UINT32_(0x0000FFFF)                                 /* (FUSES_FCCFG64) Register Mask  */


/* -------- FUSES_FCCFG65 : (FUSES Offset: 0x184) ( R/ 32) ADC Calibration -------- */
#define FUSES_FCCFG65_ADCFG0_Pos              _UINT32_(0)                                          /* (FUSES_FCCFG65)  Position */
#define FUSES_FCCFG65_ADCFG0_Msk              (_UINT32_(0xFFFFFFFF) << FUSES_FCCFG65_ADCFG0_Pos)   /* (FUSES_FCCFG65)  Mask */
#define FUSES_FCCFG65_ADCFG0(value)           (FUSES_FCCFG65_ADCFG0_Msk & (_UINT32_(value) << FUSES_FCCFG65_ADCFG0_Pos)) /* Assigment of value for ADCFG0 in the FUSES_FCCFG65 register */
#define FUSES_FCCFG65_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FCCFG65) Register Mask  */


