Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/NonSecure/firmware/src/packs/PIC32CK2051SG01144_DFP/component/fuses.h
/* -------- FUSES_FCCFG72 : (FUSES Offset: 0x1A0) ( R/ 32) MAC ID (31 through 0) -------- */
#define FUSES_FCCFG72_FMAC_31_0_Pos           _UINT32_(0)                                          /* (FUSES_FCCFG72)  Position */
#define FUSES_FCCFG72_FMAC_31_0_Msk           (_UINT32_(0xFFFFFFFF) << FUSES_FCCFG72_FMAC_31_0_Pos) /* (FUSES_FCCFG72)  Mask */
#define FUSES_FCCFG72_FMAC_31_0(value)        (FUSES_FCCFG72_FMAC_31_0_Msk & (_UINT32_(value) << FUSES_FCCFG72_FMAC_31_0_Pos)) /* Assigment of value for FMAC_31_0 in the FUSES_FCCFG72 register */
#define FUSES_FCCFG72_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FCCFG72) Register Mask  */


/* -------- FUSES_FCCFG73 : (FUSES Offset: 0x1A4) ( R/ 32) MAC ID (47 through 32) -------- */
#define FUSES_FCCFG73_FMAC_47_32_Pos          _UINT32_(0)                                          /* (FUSES_FCCFG73)  Position */
#define FUSES_FCCFG73_FMAC_47_32_Msk          (_UINT32_(0xFFFF) << FUSES_FCCFG73_FMAC_47_32_Pos)   /* (FUSES_FCCFG73)  Mask */
#define FUSES_FCCFG73_FMAC_47_32(value)       (FUSES_FCCFG73_FMAC_47_32_Msk & (_UINT32_(value) << FUSES_FCCFG73_FMAC_47_32_Pos)) /* Assigment of value for FMAC_47_32 in the FUSES_FCCFG73 register */
#define FUSES_FCCFG73_Msk                     _UINT32_(0x0000FFFF)                                 /* (FUSES_FCCFG73) Register Mask  */


/** \brief FUSES register offsets definitions */
#define FUSES_BLDRCFG_REG_OFST         _UINT32_(0x00)      /* (FUSES_BLDRCFG) Bootloader Configuration Offset */
#define FUSES_BROM_BSEQ_REG_OFST       _UINT32_(0x04)      /* (FUSES_BROM_BSEQ) Boot Configuraiton Page Sequence Number Offset */
#define FUSES_BFM_CHK_TABLEPTR_REG_OFST _UINT32_(0x08)      /* (FUSES_BFM_CHK_TABLEPTR) BFM CRC Table Pointer Offset */
#define FUSES_KEYVAL_TZ1_CE_NS_REG_OFST _UINT32_(0x20)      /* (FUSES_KEYVAL_TZ1_CE_NS) Chip Erase Key for TZ1_NS Offset */
#define FUSES_KEYVAL_TZ1_CE_NS0_REG_OFST _UINT32_(0x20)      /* (FUSES_KEYVAL_TZ1_CE_NS0) Chip Erase Key for TZ1_NS Offset */
#define FUSES_KEYVAL_TZ1_CE_NS1_REG_OFST _UINT32_(0x24)      /* (FUSES_KEYVAL_TZ1_CE_NS1) Chip Erase Key for TZ1_NS Offset */
#define FUSES_KEYVAL_TZ1_CE_NS2_REG_OFST _UINT32_(0x28)      /* (FUSES_KEYVAL_TZ1_CE_NS2) Chip Erase Key for TZ1_NS Offset */
#define FUSES_KEYVAL_TZ1_CE_NS3_REG_OFST _UINT32_(0x2C)      /* (FUSES_KEYVAL_TZ1_CE_NS3) Chip Erase Key for TZ1_NS Offset */
#define FUSES_CELOCK_TZ1_CE_NS_REG_OFST _UINT32_(0x30)      /* (FUSES_CELOCK_TZ1_CE_NS) Chip Erase Lock for TZ1_NS Offset */
#define FUSES_CELOCK_TZ1_CE_NS0_REG_OFST _UINT32_(0x30)      /* (FUSES_CELOCK_TZ1_CE_NS0) Chip Erase Lock for TZ1_NS Offset */
#define FUSES_CELOCK_TZ1_CE_NS1_REG_OFST _UINT32_(0x34)      /* (FUSES_CELOCK_TZ1_CE_NS1) Chip Erase Lock for TZ1_NS Offset */
#define FUSES_CELOCK_TZ1_CE_NS2_REG_OFST _UINT32_(0x38)      /* (FUSES_CELOCK_TZ1_CE_NS2) Chip Erase Lock for TZ1_NS Offset */
#define FUSES_CELOCK_TZ1_CE_NS3_REG_OFST _UINT32_(0x3C)      /* (FUSES_CELOCK_TZ1_CE_NS3) Chip Erase Lock for TZ1_NS Offset */
#define FUSES_KEYVAL_TZ1_CE_S_REG_OFST _UINT32_(0x40)      /* (FUSES_KEYVAL_TZ1_CE_S) Chip Erase Key for TZ1_S Offset */
#define FUSES_KEYVAL_TZ1_CE_S0_REG_OFST _UINT32_(0x40)      /* (FUSES_KEYVAL_TZ1_CE_S0) Chip Erase Key for TZ1_S Offset */
#define FUSES_KEYVAL_TZ1_CE_S1_REG_OFST _UINT32_(0x44)      /* (FUSES_KEYVAL_TZ1_CE_S1) Chip Erase Key for TZ1_S Offset */
#define FUSES_KEYVAL_TZ1_CE_S2_REG_OFST _UINT32_(0x48)      /* (FUSES_KEYVAL_TZ1_CE_S2) Chip Erase Key for TZ1_S Offset */
#define FUSES_KEYVAL_TZ1_CE_S3_REG_OFST _UINT32_(0x4C)      /* (FUSES_KEYVAL_TZ1_CE_S3) Chip Erase Key for TZ1_S Offset */
#define FUSES_CELOCK_TZ1_CE_S_REG_OFST _UINT32_(0x50)      /* (FUSES_CELOCK_TZ1_CE_S) Chip Erase Lock for TZ1_S Offset */
#define FUSES_CELOCK_TZ1_CE_S0_REG_OFST _UINT32_(0x50)      /* (FUSES_CELOCK_TZ1_CE_S0) Chip Erase Lock for TZ1_S Offset */
#define FUSES_CELOCK_TZ1_CE_S1_REG_OFST _UINT32_(0x54)      /* (FUSES_CELOCK_TZ1_CE_S1) Chip Erase Lock for TZ1_S Offset */
#define FUSES_CELOCK_TZ1_CE_S2_REG_OFST _UINT32_(0x58)      /* (FUSES_CELOCK_TZ1_CE_S2) Chip Erase Lock for TZ1_S Offset */
#define FUSES_CELOCK_TZ1_CE_S3_REG_OFST _UINT32_(0x5C)      /* (FUSES_CELOCK_TZ1_CE_S3) Chip Erase Lock for TZ1_S Offset */
#define FUSES_KEYVAL_TZ1_CE_ALL_REG_OFST _UINT32_(0x60)      /* (FUSES_KEYVAL_TZ1_CE_ALL) Chip Erase Key for TZ1_ALL Offset */
#define FUSES_KEYVAL_TZ1_CE_ALL0_REG_OFST _UINT32_(0x60)      /* (FUSES_KEYVAL_TZ1_CE_ALL0) Chip Erase Key for TZ1_ALL Offset */
#define FUSES_KEYVAL_TZ1_CE_ALL1_REG_OFST _UINT32_(0x64)      /* (FUSES_KEYVAL_TZ1_CE_ALL1) Chip Erase Key for TZ1_ALL Offset */
#define FUSES_KEYVAL_TZ1_CE_ALL2_REG_OFST _UINT32_(0x68)      /* (FUSES_KEYVAL_TZ1_CE_ALL2) Chip Erase Key for TZ1_ALL Offset */
#define FUSES_KEYVAL_TZ1_CE_ALL3_REG_OFST _UINT32_(0x6C)      /* (FUSES_KEYVAL_TZ1_CE_ALL3) Chip Erase Key for TZ1_ALL Offset */
#define FUSES_CELOCK_TZ1_CE_ALL_REG_OFST _UINT32_(0x70)      /* (FUSES_CELOCK_TZ1_CE_ALL) Chip Erase Lock for TZ1_ALL Offset */
#define FUSES_CELOCK_TZ1_CE_ALL0_REG_OFST _UINT32_(0x70)      /* (FUSES_CELOCK_TZ1_CE_ALL0) Chip Erase Lock for TZ1_ALL Offset */
#define FUSES_CELOCK_TZ1_CE_ALL1_REG_OFST _UINT32_(0x74)      /* (FUSES_CELOCK_TZ1_CE_ALL1) Chip Erase Lock for TZ1_ALL Offset */
#define FUSES_CELOCK_TZ1_CE_ALL2_REG_OFST _UINT32_(0x78)      /* (FUSES_CELOCK_TZ1_CE_ALL2) Chip Erase Lock for TZ1_ALL Offset */
#define FUSES_CELOCK_TZ1_CE_ALL3_REG_OFST _UINT32_(0x7C)      /* (FUSES_CELOCK_TZ1_CE_ALL3) Chip Erase Lock for TZ1_ALL Offset */
#define FUSES_KEYVAL_TZ0_CE_ALL_REG_OFST _UINT32_(0x80)      /* (FUSES_KEYVAL_TZ0_CE_ALL) Chip Erase Key for TZ0_ALL Offset */
#define FUSES_KEYVAL_TZ0_CE_ALL0_REG_OFST _UINT32_(0x80)      /* (FUSES_KEYVAL_TZ0_CE_ALL0) Chip Erase Key for TZ0_ALL Offset */
#define FUSES_KEYVAL_TZ0_CE_ALL1_REG_OFST _UINT32_(0x84)      /* (FUSES_KEYVAL_TZ0_CE_ALL1) Chip Erase Key for TZ0_ALL Offset */
#define FUSES_KEYVAL_TZ0_CE_ALL2_REG_OFST _UINT32_(0x88)      /* (FUSES_KEYVAL_TZ0_CE_ALL2) Chip Erase Key for TZ0_ALL Offset */
#define FUSES_KEYVAL_TZ0_CE_ALL3_REG_OFST _UINT32_(0x8C)      /* (FUSES_KEYVAL_TZ0_CE_ALL3) Chip Erase Key for TZ0_ALL Offset */
#define FUSES_CELOCK_TZ0_CE_ALL_REG_OFST _UINT32_(0x90)      /* (FUSES_CELOCK_TZ0_CE_ALL) Chip Erase Lock for TZ0_ALL Offset */
#define FUSES_CELOCK_TZ0_CE_ALL0_REG_OFST _UINT32_(0x90)      /* (FUSES_CELOCK_TZ0_CE_ALL0) Chip Erase Lock for TZ0_ALL Offset */
#define FUSES_CELOCK_TZ0_CE_ALL1_REG_OFST _UINT32_(0x94)      /* (FUSES_CELOCK_TZ0_CE_ALL1) Chip Erase Lock for TZ0_ALL Offset */
#define FUSES_CELOCK_TZ0_CE_ALL2_REG_OFST _UINT32_(0x98)      /* (FUSES_CELOCK_TZ0_CE_ALL2) Chip Erase Lock for TZ0_ALL Offset */
#define FUSES_CELOCK_TZ0_CE_ALL3_REG_OFST _UINT32_(0x9C)      /* (FUSES_CELOCK_TZ0_CE_ALL3) Chip Erase Lock for TZ0_ALL Offset */
#define FUSES_KEYVAL_CRCCMD_REG_OFST   _UINT32_(0xA0)      /* (FUSES_KEYVAL_CRCCMD) CRC Access Key Offset */
#define FUSES_KEYVAL_CRCCMD0_REG_OFST  _UINT32_(0xA0)      /* (FUSES_KEYVAL_CRCCMD0) CRC Access Key Offset */
#define FUSES_KEYVAL_CRCCMD1_REG_OFST  _UINT32_(0xA4)      /* (FUSES_KEYVAL_CRCCMD1) CRC Access Key Offset */
#define FUSES_KEYVAL_CRCCMD2_REG_OFST  _UINT32_(0xA8)      /* (FUSES_KEYVAL_CRCCMD2) CRC Access Key Offset */
#define FUSES_KEYVAL_CRCCMD3_REG_OFST  _UINT32_(0xAC)      /* (FUSES_KEYVAL_CRCCMD3) CRC Access Key Offset */
#define FUSES_KEYCONFIG_CRCCMD_REG_OFST _UINT32_(0xB0)      /* (FUSES_KEYCONFIG_CRCCMD) CRC Access Key Configuration Offset */
#define FUSES_KEYCONFIG_CRCCMD0_REG_OFST _UINT32_(0xB0)      /* (FUSES_KEYCONFIG_CRCCMD0) CRC Access Key Configuration Offset */
#define FUSES_KEYCONFIG_CRCCMD1_REG_OFST _UINT32_(0xB4)      /* (FUSES_KEYCONFIG_CRCCMD1) CRC Access Key Configuration Offset */
#define FUSES_KEYCONFIG_CRCCMD2_REG_OFST _UINT32_(0xB8)      /* (FUSES_KEYCONFIG_CRCCMD2) CRC Access Key Configuration Offset */
#define FUSES_KEYCONFIG_CRCCMD3_REG_OFST _UINT32_(0xBC)      /* (FUSES_KEYCONFIG_CRCCMD3) CRC Access Key Configuration Offset */
#define FUSES_KEYVAL_HOSTDALELEV_REG_OFST _UINT32_(0xC0)      /* (FUSES_KEYVAL_HOSTDALELEV) Host Authenticated DAL Elevation Key Offset */
#define FUSES_KEYVAL_HOSTDALELEV0_REG_OFST _UINT32_(0xC0)      /* (FUSES_KEYVAL_HOSTDALELEV0) Host Authenticated DAL Elevation Key Offset */
#define FUSES_KEYVAL_HOSTDALELEV1_REG_OFST _UINT32_(0xC4)      /* (FUSES_KEYVAL_HOSTDALELEV1) Host Authenticated DAL Elevation Key Offset */
#define FUSES_KEYVAL_HOSTDALELEV2_REG_OFST _UINT32_(0xC8)      /* (FUSES_KEYVAL_HOSTDALELEV2) Host Authenticated DAL Elevation Key Offset */
#define FUSES_KEYVAL_HOSTDALELEV3_REG_OFST _UINT32_(0xCC)      /* (FUSES_KEYVAL_HOSTDALELEV3) Host Authenticated DAL Elevation Key Offset */
#define FUSES_KEYCONFIG_HOSTDALELEV_REG_OFST _UINT32_(0xD0)      /* (FUSES_KEYCONFIG_HOSTDALELEV) Host Authenticated DAL Elevation Key Configuration Offset */
#define FUSES_KEYCONFIG_HOSTDALELEV0_REG_OFST _UINT32_(0xD0)      /* (FUSES_KEYCONFIG_HOSTDALELEV0) Host Authenticated DAL Elevation Key Configuration Offset */
#define FUSES_KEYCONFIG_HOSTDALELEV1_REG_OFST _UINT32_(0xD4)      /* (FUSES_KEYCONFIG_HOSTDALELEV1) Host Authenticated DAL Elevation Key Configuration Offset */
#define FUSES_KEYCONFIG_HOSTDALELEV2_REG_OFST _UINT32_(0xD8)      /* (FUSES_KEYCONFIG_HOSTDALELEV2) Host Authenticated DAL Elevation Key Configuration Offset */
#define FUSES_KEYCONFIG_HOSTDALELEV3_REG_OFST _UINT32_(0xDC)      /* (FUSES_KEYCONFIG_HOSTDALELEV3) Host Authenticated DAL Elevation Key Configuration Offset */
#define FUSES_ROM_CTRLA_REG_OFST       _UINT32_(0xE0)      /* (FUSES_ROM_CTRLA) ROM CTRLA Settings  (BROM_PLLEN must be set) Offset */
#define FUSES_FCR_CTRLA_REG_OFST       _UINT32_(0xE4)      /* (FUSES_FCR_CTRLA) FCR CTRLA Settings (BROM_PLLEN must be set) Offset */
#define FUSES_RPMU_VREGCTRL_REG_OFST   _UINT32_(0xE8)      /* (FUSES_RPMU_VREGCTRL) RPMU VREGCTRL Settings (BROM_PLLEN must be set) Offset */
#define FUSES_PLL0_CTRL_REG_OFST       _UINT32_(0xEC)      /* (FUSES_PLL0_CTRL) PLL0 CTRL Settings (BROM_PLLEN must be set) Offset */
#define FUSES_PLL0_FBDIV_REG_OFST      _UINT32_(0xF0)      /* (FUSES_PLL0_FBDIV) PLL0 FBDIV Settings (BROM_PLLEN must be set) Offset */
#define FUSES_PLL0_REFDIV_REG_OFST     _UINT32_(0xF4)      /* (FUSES_PLL0_REFDIV) PLL0 REFDIV Settings (BROM_PLLEN must be set) Offset */
#define FUSES_PLL0_POSTDIVA_REG_OFST   _UINT32_(0xF8)      /* (FUSES_PLL0_POSTDIVA) PLL0 POSTDIVA Settings (BROM_PLLEN must be set) Offset */
#define FUSES_MCLK_CLKDIV1_REG_OFST    _UINT32_(0xFC)      /* (FUSES_MCLK_CLKDIV1) MCLK CLKDIV1 Settings (BROM_PLLEN must be set) Offset */
#define FUSES_GCLK_GENCTRL0_REG_OFST   _UINT32_(0x100)     /* (FUSES_GCLK_GENCTRL0) GCLK GENCTRL0 Settings (BROM_PLLEN must be set) Offset */
#define FUSES_BROM_BOOTCFGCRC_REG_OFST _UINT32_(0x110)     /* (FUSES_BROM_BOOTCFGCRC) Boot Configuraiton Page CRC Offset */
#define FUSES_BROM_BOOTCFGCRC0_REG_OFST _UINT32_(0x110)     /* (FUSES_BROM_BOOTCFGCRC0) Boot Configuraiton Page CRC Offset */
#define FUSES_BROM_BOOTCFGCRC1_REG_OFST _UINT32_(0x114)     /* (FUSES_BROM_BOOTCFGCRC1) Boot Configuraiton Page CRC Offset */
#define FUSES_BROM_BOOTCFGCRC2_REG_OFST _UINT32_(0x118)     /* (FUSES_BROM_BOOTCFGCRC2) Boot Configuraiton Page CRC Offset */
#define FUSES_BROM_BOOTCFGCRC3_REG_OFST _UINT32_(0x11C)     /* (FUSES_BROM_BOOTCFGCRC3) Boot Configuraiton Page CRC Offset */
#define FUSES_BROM_PAGEEND_REG_OFST    _UINT32_(0x120)     /* (FUSES_BROM_PAGEEND) Page End Marker for Verified Data Offset */
#define FUSES_DAL_REG_OFST             _UINT32_(0x00)      /* (FUSES_DAL) Debug Access Level Offset */
#define FUSES_FSEQ_REG_OFST            _UINT32_(0x00)      /* (FUSES_FSEQ) Flash Sequence Number Offset */
#define FUSES_FSEQ0_REG_OFST           _UINT32_(0x00)      /* (FUSES_FSEQ0) Flash Sequence Number Offset */
#define FUSES_FSEQ1_REG_OFST           _UINT32_(0x04)      /* (FUSES_FSEQ1) Flash Sequence Number Offset */
#define FUSES_FSEQ2_REG_OFST           _UINT32_(0x08)      /* (FUSES_FSEQ2) Flash Sequence Number Offset */
#define FUSES_FSEQ3_REG_OFST           _UINT32_(0x0C)      /* (FUSES_FSEQ3) Flash Sequence Number Offset */
#define FUSES_FSEQ4_REG_OFST           _UINT32_(0x10)      /* (FUSES_FSEQ4) Flash Sequence Number Offset */
#define FUSES_FSEQ5_REG_OFST           _UINT32_(0x14)      /* (FUSES_FSEQ5) Flash Sequence Number Offset */
#define FUSES_FSEQ6_REG_OFST           _UINT32_(0x18)      /* (FUSES_FSEQ6) Flash Sequence Number Offset */
#define FUSES_FSEQ7_REG_OFST           _UINT32_(0x1C)      /* (FUSES_FSEQ7) Flash Sequence Number Offset */
#define FUSES_AFSEQ_REG_OFST           _UINT32_(0x20)      /* (FUSES_AFSEQ) Alternate Flash Sequence Number Offset */
#define FUSES_AFSEQ0_REG_OFST          _UINT32_(0x20)      /* (FUSES_AFSEQ0) Alternate Flash Sequence Number Offset */
#define FUSES_AFSEQ1_REG_OFST          _UINT32_(0x24)      /* (FUSES_AFSEQ1) Alternate Flash Sequence Number Offset */
#define FUSES_AFSEQ2_REG_OFST          _UINT32_(0x28)      /* (FUSES_AFSEQ2) Alternate Flash Sequence Number Offset */
#define FUSES_AFSEQ3_REG_OFST          _UINT32_(0x2C)      /* (FUSES_AFSEQ3) Alternate Flash Sequence Number Offset */
#define FUSES_AFSEQ4_REG_OFST          _UINT32_(0x30)      /* (FUSES_AFSEQ4) Alternate Flash Sequence Number Offset */
#define FUSES_AFSEQ5_REG_OFST          _UINT32_(0x34)      /* (FUSES_AFSEQ5) Alternate Flash Sequence Number Offset */
#define FUSES_AFSEQ6_REG_OFST          _UINT32_(0x38)      /* (FUSES_AFSEQ6) Alternate Flash Sequence Number Offset */
#define FUSES_AFSEQ7_REG_OFST          _UINT32_(0x3C)      /* (FUSES_AFSEQ7) Alternate Flash Sequence Number Offset */
#define FUSES_FUCFG0_REG_OFST          _UINT32_(0x40)      /* (FUSES_FUCFG0) WDT Configuration Offset */
#define FUSES_FUCFG1_REG_OFST          _UINT32_(0x44)      /* (FUSES_FUCFG1) User Configuration 1 (System Bus Configuration) Offset */
#define FUSES_FUCFG2_REG_OFST          _UINT32_(0x48)      /* (FUSES_FUCFG2) User Configuration 2 (Deep Sleep SMOR Configuration) Offset */
#define FUSES_FUCFG3_REG_OFST          _UINT32_(0x4C)      /* (FUSES_FUCFG3) User Configuration 2 (SMOR Configuration) Offset */
#define FUSES_FUCFG5_REG_OFST          _UINT32_(0x54)      /* (FUSES_FUCFG5) User Configuration 5 (VREG Charge Pump Configuration) Offset */
#define FUSES_FUCFG6_REG_OFST          _UINT32_(0x58)      /* (FUSES_FUCFG6) User Configuration 6 (FCR ECCCTRL Configuration) Offset */
#define FUSES_FUCFG7_REG_OFST          _UINT32_(0x5C)      /* (FUSES_FUCFG7) User Configuration 7 (FCR CTRLB Configuration) Offset */
#define FUSES_FUCFG8_REG_OFST          _UINT32_(0x60)      /* (FUSES_FUCFG8) User Configuration 8 (FCW CWP Configuration) Offset */
#define FUSES_FUCFG9_REG_OFST          _UINT32_(0x64)      /* (FUSES_FUCFG9) User Configuration 9 (RAM BISR and ECC Configuraiton) Offset */
#define FUSES_FUCFG10_REG_OFST         _UINT32_(0x68)      /* (FUSES_FUCFG10) User Configuration 10 (Peripheral Bus A security attribution Offset */
#define FUSES_FUCFG11_REG_OFST         _UINT32_(0x6C)      /* (FUSES_FUCFG11) User Configuration 11 (Peripheral Bus B security attribution Offset */
#define FUSES_FUCFG12_REG_OFST         _UINT32_(0x70)      /* (FUSES_FUCFG12) User Configuration 12 (Peripheral Bus C security attribution Offset */
#define FUSES_FUCFG13_REG_OFST         _UINT32_(0x74)      /* (FUSES_FUCFG13) User Configuration 13 (AHB peripheral security attribution Offset */
#define FUSES_FUCFG14_REG_OFST         _UINT32_(0x78)      /* (FUSES_FUCFG14) PFM IDAU Configuration Offset */
#define FUSES_FUCFG15_REG_OFST         _UINT32_(0x7C)      /* (FUSES_FUCFG15) RAM IDAU Configuration Offset */
#define FUSES_FUCFG16_REG_OFST         _UINT32_(0x80)      /* (FUSES_FUCFG16) User Configuration 16 (HSM Firmware Metadata 0 Address) Offset */
#define FUSES_FUCFG24_REG_OFST         _UINT32_(0xA0)      /* (FUSES_FUCFG24) User Configuration 24 (HSM Firmware Metadata 1 Address) Offset */
#define FUSES_FCCFG64_REG_OFST         _UINT32_(0x180)     /* (FUSES_FCCFG64) PTC Calibration Offset */
#define FUSES_FCCFG65_REG_OFST         _UINT32_(0x184)     /* (FUSES_FCCFG65) ADC Calibration Offset */
#define FUSES_FCCFG66_REG_OFST         _UINT32_(0x188)     /* (FUSES_FCCFG66) Comparator Calibration Offset */
#define FUSES_FCCFG69_REG_OFST         _UINT32_(0x194)     /* (FUSES_FCCFG69) Temperature  calibration values 0 Offset */
#define FUSES_FCCFG70_REG_OFST         _UINT32_(0x198)     /* (FUSES_FCCFG70) Temperature  calibration values 1 Offset */
#define FUSES_FCCFG71_REG_OFST         _UINT32_(0x19C)     /* (FUSES_FCCFG71) Temperature  calibration values 2 Offset */
#define FUSES_FCCFG72_REG_OFST         _UINT32_(0x1A0)     /* (FUSES_FCCFG72) MAC ID (31 through 0) Offset */
#define FUSES_FCCFG73_REG_OFST         _UINT32_(0x1A4)     /* (FUSES_FCCFG73) MAC ID (47 through 32) Offset */

